Feature: Изтриване на тема
  Scenario Outline: Изтриване на тема
    Given Потребителя натиска бутона за изтриване на темата
    When Системата взима името на темата "<name>"
    And Системата взима името на потребителя "<user>"
    And Потребителя натиска бутона за потвърждение за изтриване на темата
    Then Вижда съобщение "<expectedMessage>"

    Examples:
      |name|user|expectedMessage|
      |Test|Ivan|Успешно изтрихте темата|
      |    |Ivan|Моля въведете името на темата|
      |Test|Gosho|Нямате права да изтриете темата|