Feature: Изтриване на коментар от тема
  Scenario Outline: Изтриване на коментар от тема
    Given Потребителя натиска бутона за изтриване на коментара
    And Системата взима съдържанието на коментара "<content>"
    And Системата взима потребителското име на потребителят "<user>"
    And Системата взима името на името на темата към която е коментара "<topicName>"
    And Потребителя натиска бутона за потвърждение за изтриване на коментара
    Then Вижда съобщението на екрана "<expectedMessage>"

    Examples:
      |content|user|topicName|expectedMessage|
      |Hello  |Ivan|Test     |Успешно изтрихте коментара|
      |Hello  |Gosho|Test    |Нямате права да изтриете коментара|