Feature: Регистрация на потребител във форума
  Scenario Outline: Регистрация на потребител във форума
    Given Потребителя отваря страницата за регистрация в системата
    When Потребителя въвежда потребителско име за регистрация "<username>"
    And Потребителя въвежда парола за регистрация "<password>"
    And Потребителя натиска бутона за регистрация в системата
    Then Получава съобщението на екрана "<expectedMessage>"

    Examples:
      |username|password|expectedMessage|
      |tony|123   |Регистрацията е успешна|
      |    |123   |Моля въведете потребителско име|
      |tony|      |Моля въведете парола|
      |Ivan|123   |Потребителското име е заето|